# 1) მომხმარებელს შემოატანინე სიტყვა ანდა ტექსტი.  
# -> გაიგე ამ სიტყვის/ტექსტის სიგრძე და დაპრინტე 
# -> for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

user = str(input("type text or word: "))

print(len(user))

for i in range(len(user)):
    print(user[i])

# 2)  შექმენით სია სადაც შეინახავთ სტრინგებს.
# დაუარეთ სიის თითოეულ ელემენტს:
# 1. დაპრინტეთ რამდენი სიმბოლოსაგან შედგება სიტყვა
# 2. თუ სიტყვის სიგრძე არის: 
# --> კენტი დაპრინტეთ 'კენტია'
# --> ლუწი დაპრინტეთ 'ლუწია'

string = ["rezi", "gega", "goga", "nika"]

for i in len(string):
    print(len(i),"== სიმბოლო")
    
    if len(i) % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")
