/*1)შექმენი ფუნქცია და დააარქვი რაიმე სახელი ,
შენი დავალებაა რომ ამ ფუნქციამ კონსოლში გამოიტანოს
შენი სახელი და გვარი, გამოიძახე ფუნქცია და ნახე შედეგი კონსოლში*/ 


function name(){
    console.log("rezi rezesidze")
}

name()

/*2)შენი დავალებაა შექმნა ფუნქცია და გადასცე სამი პარამეტრი(შენი სურვილით)
ასევე ამ სამივე პარამეტრს მიანიჭე დეფაულთ მნიშვნელობები,
შენი დავალებაა ფუნქციამ დააკონსოლლოგოს რაიმე წინადადება სადაც გამოყენებული
იქნება ყველა ეს პარამეტრი , გამოიძახე ფუნქცია ოთხჯერ შემდეგნაირად -->
არგუმენტი მიანიჭე მხოლოდ პირველ პარამეტრს და ნახე შედეგი ,
არგუმენტი მიანშე პირველ და მეორე პარამეტრს და ნახე შედეგი ,
არგუმენტი მიანიჭე სამივე პარამეტრს და ნახე შედეგი ,
არგუმენტი არ მიანიჭო არც ერთ პარამეტრს და ნახე შედეგი*/ 

function person(name = "rezi" , surname = "rezesidze" , age = "15"){
    console.log(`my name is ${name}, my surname is ${surname} and im ${age} years old.`)
}

person("goga")
person("giorgi" , "gergedava")
person("gega" , "gabunia" , 14)
person()
