# 1)მოცემულია სია --> [1, 2, 3, 4, 5, 6]
# შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].

list = [1, 2, 3, 4, 5, 6]

list[2:4] = [10, 20, 30]

print(list)

# 2)მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
# შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].


list1 = ["apple", "banana", "cherry", "kiwi", "mango"]

list1[:2] = ["pear", "plum"]

print(list1)

# 3)ოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
# შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].

list2 = ["a", "b", "c", "d", "e", "f"]

list2[-3:] = ["x", "y", "z"]

print(list2)

# 4)მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
# შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].

list3 = ["red", "green", "blue", "yellow", "black", "white"]

list3[2:5] = ["purple", "orange"]


print(list3)

# 5)მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
# შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]

list4 = ["გიორგი" , "ირმა" , "საბა"]

list4 = ["red", "green", "blue", "yellow", "black", "white"]

print(list4)

# 6) მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი , თუ ლუწია დაპრინტე --> "Even" ,თუ კენტია დაპრინტე --> "Odd".

number = int(input("შეიყვანეთ რიცხვი: "))

if number % 2 == 0:
    print("number is even")
else:
    print("number is odd")

# 7)შექმენი სია --> სადაც შეინახავ ინტეჯერებს ,შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არუს ლუწი დაპრინტე --> "Even number" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"

list5 = [1,2,3,4,5,6,7,8,9,10]

if list5[3] % 2 == 0:
    print("Even number")
else:
    print("Odd number")

# 8)შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე --> "ეს რიცხვი არის ლუწი და მეტი 50 ზე" , თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე --> "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"


list6 = [1,2,3,4,5,6,7,8,9,10]

if list6[-1] % 2 == 0 and list6[-1] > 50:
    print("ეს რიცხვი არის ლუწი და მეტი 50 ზე")
else:
    print("ეს რიცხვი არის კენტი და ნაკლები 50 ზე")

# 9)შექმენი სია სადაც შეინახავ ინტეჯერებს,თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე --> "even or more than 100" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> odd or less than 100


list7 = [1,2,3,4,5,6,7,8,9,10]

if list7[5] % 2 == 0 or list7[5] > 100:
    print("even or more than 100")

if list7[3] % 2 != 0 or list7[3] < 100:
    print("odd or less than 100")

# 10)შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს , შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს , გამოიყენე ახლად ნასწავლი ოპერატორი != 


string1 = "rezi"
string2 = "dachi"

print(string1 != string2)
