# 1)მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ  ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც

# +
print(100+10)
print(1537+451)
print(10+10)
# -
print(1000-100)
print(6523625-67276)
print(1-1)
# *
print(5*7)
print(35*56)
print(454*7)
# /
print(1000/5)
print(10/2)
print(1123/32)
# //
print(100//20)
print(12//6)
print(79//70)
# **
print(10**4)
print(168784**2)
print(14**12)
# %
print(100%14)
print(54%23)
print(42%6)



# 2)კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინო

# 1)// ასეთი გაყოფა გვიბრუნებს ყოველთვის ინტეჯერ ტიპის მონაცემს(მთელ რიცხვს)და პასუხად გვაძლევს: თუ რამდენჯერ მოთავსდება ერთი რიცხვი მეორე რიცხვში მაგ: 
# print(100//20)
# print(12//6)
# print(79//70)


# 2)** --> ეს ოპერატორი გვეხმარება რომ რიცხვი ავიყვანოთ რაიმე ხარისხში, მაგ: 
# print(10**4)
# print(168784**2)
# print(14**12)


# 3)%  --> გვიბრუნებს ნაშთს როდესაც ერთ რიცხვს ვყობთ მეორეზე მაგ:
# print(100%14)
# print(54%23)
# print(42%6)




# 3)დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , ანუ სულ 15 მაგალით უნდა გქონდეთ

# //
print(10012131//2000)
print(12//6)
print(79//70)
print(45//3)
print(34//4)
# **
print(10**4)
print(168784**2)
print(14**12)
print(400**13)
print(175**15)
# %
print(103%14)
print(50%23)
print(92%6)
print(400%4)
print(1%1)


# 4)ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

15 / 3 = 5
20 / 4 = 5
100 / 20 = 5

15 // 10 = 1
10 // 7 = 1
40 // 12 = 3

4 * 3 = 12
40 * 3 = 120
120 * 3 = 360

4 ** 3 = 64
10 ** 3 = 1000
2 ** 6 = 64
3 ** 4 = 81

10 % 7 = 3
3 % 2 = 1
50 % 25 = 0
14 % 11 = 3
110 % 50 = 10



# 5)კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს,და რით განსხვავდებიან ისინი ცვლადებისაგან


# სიები გვეხმარება რომ შევინახოთ მრავალი ელემენტი ნებისმიერი მონაცემთა ტიპის და ნებოისმიერი რაოდენობის სიის შესაქმნელად ვიყენებთ კვადრატულ ფრჩხილებს და სიას ვარქმევთ სახელს ხოლო ცვლადებშოი მხოლოდ 1 ელემენტის გამყენება შეგვიძლია ნებისმიერი მონაცემთა ტიპით


# 6)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები
strings = ["rezi","dachi","jora"]

# 7)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები
integers = [10,1,23,3432,4325,45]

# 8)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები
floats = [10.2,12.61,21323.3,2.1]

#  9)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები
booleans = [True,False]

# 10)შექმენით სია,შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი
everithing = ["rezi",100,2.1,True]

# 11)მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები(თან დაპრინტეთ რომ ნახოთ შედეგი)

num = int(input("type any number: "))
num1 = int(input("type any number: "))

print(num + num1)
print(num - num1)
print(num * num1)
print(num / num1)
print(num // num1)
print(num ** num1)
print(num % num1)

# 12)მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი რიცხვი არის 30 ზე მეტი და 100ზე ნაკლები დაუპრინტე --> "between 30 and 100", თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე --> "between 100 and 200" , სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number"

num3 = int(input("put any number: "))

if 30 < num3 < 100:
    print("between 30 and 100")
elif 100 < num3 < 200:
    print("between 100 and 200")
else:
    print("other number")


# 13)შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები(გამოიყენეტ ნასწავლი ფუნქცია)

string = "rezi"
integer = 14
float = 1.70
boolean = True
list = [1,"rezi",1.70,True]

print(type(string))
print(type(integer))
print(type(float))
print(type(boolean))
print(type(list))


# 14)while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60 ...

number = 50
while number <= 100:
    print(number)
    number += 5 

# 15)for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 ...

for i in range(40,91,3):
    print(i)


# 16)გამოიტანე შენი სახელი და გვარი 15 ჯერ,გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით

for i in range(15):
    print("rezi rezesidze")

i = 0
while i < 15:
    print("rezi rezesidze")
    i += 1


# # 17)
# # შექმენი ცვლადი სადაც შეინახავ შენს სახელს
# # შექმენი ცვლადი სადაც შეინახავ შენს გვარს
# # მომხმარებელს შემოატანინეთ სახელი
# # თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
# #       მომხმარებელს შემოატანინე გვარი
# #       თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
# #             დაპრინტე --> same name and surname
# #       სხვა შემთხვევაში
# #             დაპრინტე -- > same name but different surname
# # სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
# #     დაპრინტე --> aqedan moshordi


# # HARDER(შეეცადეთ რომ ამოხსნათ თუ ვერ გამოვა შემდედგზე განვიხილავთ,მაინტერესებს დაძლევთ თუარა წესით უნდა გააკეთოთ!!!!!


name = "rezi"
surname = "rezesidze"

user = input("type your name: ")

if user == name:
    user_surname = input("type your surname: ")
    if user_surname == surname:
        print("same name and surname")
    else:
        print("same name but different surname")
else:
    print("aqedan moshordi")



# 18)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი



password = "2011"

while True:
    user_password = input("type password: ")
    if user_password == password:
        print("you guesed it")
        break
    else:
        print("type password again")



























