# 1)ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True
print(456==456 and 55555>90)
print(214>1 and 568<78987)
print(9201==9201 and 667>43)
print(78787==9278 and 89>909)
print(556==666 and 67>78)

print(10==789 or 66>233)
print(44<927 or 4213==7)
print(234==2340 or 900>4566)
print(13==14 or 430>342)
print(222==221 or 156>67)

# 2)კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით
# selection -- არჩევა 
# sequensing -- თანმიმდევრობა 
# iteraition -- გამეორება, როდეაც რაღაც მოქმედება მეორდება რამდენჯერმე ან სულ

# 3)მოიყვანე secuencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence
print(443)
print(1.70)
print("5344")
print("rezi")

# sequencing არის რადგან აქ არის თანმიმდევრობა. იწყება ზემოდან მთავრდება ქვევით 

# 4)კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის
# for loop გვეხმარება გამეორებაში

# 5)კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop
# range() ში უნდა ჩავწეროთ თუ რამდენჯერ გვინდა ნებისმიერი რამის გამეორება

# 6)შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop
for i in range(1):
    print("BMW")

# 7)შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ
for i in range(100):
    print("rezesidze")

# 8)შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ
for i in range(46):
    print("red")

# 9)შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ
for i in range(32):
    print("r")

# 10)მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია(გამოიყენე შესაბამისი ფუნქცია რომ მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია)
name = input("type your name: ")
name1 = input("type any name: ")
name2 = input("type any name: ")
age = str(input("type your age: "))
print(name + name1 + name2 + age)

# 11)შექმენი 4 ცვლადი,თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები,შენი დავალებაა გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი(გამოიყენე შესაბამისი ფუნქცია)
name3 = type("rezi rezesidze")
age1 = type(14)
height = type(1.70)
boolean = type(True and False)
print(name3)
print(age1)
print(height)
print(boolean)

# 12)მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამი
num1 = int(input("type any number: "))
num2 = int(input("type any number: "))
num3 = int(input("type any number: "))
num4 = int(input("type any number: "))
print(num1 + num2 + num3 + num4)

















