// //1)შექმენით სია სადაც იქნება სახელები , გამოიტანეთ მხოლოდ ის სახელები რომლის სიგრძე მეტია 4 ზე

// let names = ["rezi","dachi","gio","anastasia"]

// names.forEach((name) => {
//     if(name.length > 4){
//         console.log(name)
//     }
// })


// //2)შექმენით სია სადაც მოცემული იქნება რიცხვები , თქვენი დავალებაა გამოიტანოთ მხოლოდ ისეთი რიცხვები რომელიც არის კენტი და დგას კენტ ინდექსზე

// let num = [1,2,3,4,5,6,7,8,9,10]

// num.forEach((n,index) => {
//     if(n % 2 != 0 && index % 2 != 0){
//         console.log(n)
//     }
// })

/*3)მოცემულია:

let scores = [45, 78, 32, 90, 56, 84, 67];

გამოიყენე .map() და შექმენი ახალი სია newScores.

წესები:

თუ ქულა 60-ზე ნაკლებია, მას დაემატოს 10.
თუ ქულა 60 ან მეტია, მას დაემატოს 5.
ძველი scores სია არ უნდა შეიცვალოს.
გამოიყენე ერთი .map().*/ 

let scores = [45, 78, 32, 90, 56, 84, 67]

let newScores = scores.map(s => {
    if(s < 60){
        return s + 10
    }else{
        return s + 5
    }
})


console.log(scores)
console.log(newScores)
