# 1)კომენტარის სახით ახსენით თუ რა არის index და რაში ვიყენებთ მას

# indexss ვიყენებთ იმაში რომ მივწვდეთ რომელიმე კონკრეტულ ელემენტს, ამისათვის ვწერთ იმ სიის სახელს რომელი სიიდანაც მინდა რომ ამოვიღო ელემენტი,შემდეგ ვხსნი ფრჩხილებს --> [], შემდეგ ამ ფრჩხილებში ვწერ იმ ელემენტის მისამართს (index), რომელი ელემენტის გამოტანა მინდა ტერმინალში


# 2)შექმენით ცვლადი სადაც შეინახავთ ამ სიას [4,6,1,5,9,8,4] ,თქვენი დავალებაა რომ მიწვდეთ ამ სიაში ელემენტებს ინდექსინგის გამოყენებით ,შეკრიბეთ ორი რიცხვი რომ მიიღთ შემდეგი რიცხვები --> 10 , 2 , 14 , 20 , 4 , 7 , 27 , გამოიყენეთ მათემატიკური ოპერატოები
my_list = [4, 6, 1, 5, 9, 8, 4]

result1 = my_list[1] + my_list[0]
result2 = my_list[1] - my_list[0]
result3 = my_list[3] + my_list[4]
result4 = my_list[0] * my_list[3]
result5 = my_list[5] // 2
result6 = my_list[1] + my_list[2]
result7 = my_list[4] + my_list[5] + (my_list[1] + my_list[0])

print(result1, result2, result3, result4, result5, result6, result7)



# 3)შექმენით სია სადაც შეიყვანთ ადამიანის სახელებს,უნდა გქონდეთ სულ 10 სახელი,თქვენი დავალებაა რომ გამოიტანოტ ,მე 5 , მე 9 ,მე 3 ,მე 7 და პირველ ინდექსზე მდგომი ელემენტები ცალ ცალკე,გამოიყენეთ ინდექსინგი

names = ["ნიკოლოზი", "მარიამი", "ლაშა", "თეკლა", "გიორგი", "ანა", "დავით", "მარიამი", "თამაზ", "ნანა"]

indices_to_print = [5, 9, 3, 7, 1]

for i in indices_to_print:
    print(names[i])

# 4)შექმენით სია სადაც მოათავსებთ სტრინგ ტიპის მონაცემებს,თქვენი დავალებაა გომ for loop და while loop (ორივე) ს დახმარებით გამოიტანოთ თთოეული ელემენტი ცალ ცალკე

fruits = ["ვაშლი", "ბანანი", "ანანასი", "სტაფილო", "ქლიავი"]

for i in range(5):
    print(fruits[i])


i = 0
while i < len(fruits):
    print(fruits[i])
    i += 1


# 5)შექმენით სია სადაც შეინახავთ 7 ცალ ელემენტს(მონაცემის ტიპს არ აქვს მნიშვნელობა),თქვენი დავალებაა რომ ამ სიაში შეცვალოთ მე 3 ინდექსზე დმგომი ელემენტი და ჩაანაცვლო "vashli" ით, ასევე შეცვალე მე 6 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე 'msxali' ით ,ასევე შეცვალე მე 4 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე ის 'atami" ით,გამოიტანე საბოლოო სია ტერმინალში,სადაც ეს სალი ელემენტი იქნება განახლებული~

my_list = [10, "geo", 3.14, "banana", "apple", 42, True]

my_list[3] = "vashli"

my_list[6] = "msxali"

my_list[4] = "atami"

print(my_list)


# 6)იპოვეთ საბოლოო პასუხი--> True and False or False and True or false and false or true ---> ...

true_or_false = True and False or False and True or False and False or True
print(true_or_false)



# 7)შექმენით სია სადაც მოთავსებული გექნებათ ცხოველების სახელები, თქვენი დავალებაა რომ -->  თუ ამ სიაში მოთავსებული მე 3 ინდექსზე მდგომი ელემენტი არის ლომი მაშნ დაპრინტე --> "there is lion on index 3" სხვა შემთხვევაში დაუპრინტე რომ --> "there is no lion on index 3"


animals = ["ძაღლი", "კატა", "ვეფხვი", "ლომი", "სპილო", "მაიმუნი", "მელია"]

if animals[3] == "ლომი":
    print("there is lion on index 3")
else:
    print("there is no lion on index 3")



# 8)
# basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]
# დაბეჭდეთ კალათის პირველი ხილი.
# დაბეჭდეთ კალათის მესამე ხილი.
# შეცვალეთ მეორე ხილი "ბანანი" სხვა ხილით (თქვენი არჩევანით).
# დაბეჭდეთ თავიდან ბოლომდე ყველა ხილი ცალ–ცალკე, ინდექსების გამოყენებით (არა for-ით).

basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

print(basket[0])

print(basket[2])

basket[1] = "ფორთოხალი"

print(basket[0])
print(basket[1])
print(basket[2])
print(basket[3])
print(basket[4])

# 9)
# letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]
# დაბეჭდეთ მესამე ასო.
# დაბეჭდეთ მე–5 და მე–6 ასო.
# დაბეჭდეთ ბოლო ასო.
# ააწყეთ სიტყვა "მამა" ინდექსებით (ყველა ასო ინდექსით უნდა აიღონ და შეაერთონ).
# ააწყეთ სიტყვა "გოლა".
# ააწყვეთ სიტყვა "გოგა"


letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

print(letters[2])

print(letters[4], letters[5])

print(letters[9])

mama = letters[6] + letters[5] + letters[6] + letters[5]
print(mama)

gola = letters[2] + letters[3] + letters[4] + letters[5]
print(gola)

goga = letters[2] + letters[3] + letters[2] + letters[5]
print(goga)


# 10)
# letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]
# აიღეთ მე–4 ინდექსზე არსებული ასო და შეინახე ცვლადში
# თუ ეს ასო არის "ლ", დაბეჭდეთ: "სწორია! ასო ლ ა"
# სხვა შემთხვევაში დაბეჭდეთ: "არასწორია, სცადე თავიდან"
# =========================
# აიღეთ ბოლო ასო და შეინახე ცვლადში
# თუ ეს "ე"–ა, დაბეჭდეთ "საიდუმლო სიტყვა იწყება სწორად".
# სხვა შემთხვევაში – "საიდუმლო სიტყვა არასწორია".
# ==========================
# ააწყვეთ სიტყვა "გელა" და შეინახე ცვლადში 
# თუ ცვლადში შენახული სიტყვა "გელა"–ს ტოლია, დაბეჭდეთ "გაარტყი სახელი!"
# სხვა შემთხვევაში – "შტერი ხარ!დ".


letters2 = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

letter_index4 = letters2[4]

if letter_index4 == "ლ":
    print("სწორია! ასო ლ ა")
else:
    print("არასწორია, სცადე თავიდან")

last_letter = letters2[9]

if last_letter == "ე":
    print("საიდუმლო სიტყვა იწყება სწორად")
else:
    print("საიდუმლო სიტყვა არასწორია")

word = letters2[2] + letters2[9] + letters2[4] + letters2[5]

if word == "გელა":
    print("გაარტყი სახელი!")
else:
    print("შტერი ხარ!დ")

# 11)შექმენი სია რომელიც იქნება სტრინგებით სავსე,შენი დავალებაა რომ მომხმარებელს შემოატანინო რაიმე რიცხვი,შენი დავალებაა რომ ამ სიიდან გამოიტანო მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი

colors = ["თეთრი", "ცისფერი", "მწვანე", "ყვითელი", "წითელი", "შავი", "ნარინჯისფერი"]

index = int(input("შეიყვანე ინდექსი (0-დან 6-მდე): "))

if index >= 0 and index <= 6:
    print("თქვენი არჩეული ფერია:", colors[index])
else:
    print("არასწორი ინდექსი! სცადე თავიდან.")


