# 1)დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში

for i in range(0,39):
    print(i)

# 2)დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში

for i in range(30,40):
    print(i)

# 3)დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში

for i in range(12,120):
    print(i)

# 4)დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ

for i in range(18):
    print("rezi")
    print(14)

# 5)დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში

for i in range(10,100,3):
    print(i)

# 6)ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ ,მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი

for i in range(30):
    print(i,"ბანანი")

# 7)მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop

for i in range(13):
    input("enter your name: ")

# 8)გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

i = 0
while i < 10:
    print("rezi")
    i = i + 1

# 9)დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop

i = 0
while i < 25:
    print(i)
    i = i + 1

# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ

for i in range(0,89):
    print(i,"bmw")


for i in range(9,44):
    print(i)


for i in range(2,91):
    print(i,"phone")


for i in range(0,67):
    print("porche")




i = 0
while i < 45:
    print(i)
    i = i + 1


i = 0
while i < 12:
    print("rezi")
    i = i + 5


i = 0
while i < 25:
    print(i,"bmw")
    i = i + 1


i = 0
while i < 67:
    print("bugatti")
    i = i + 1


i = 8
while i < 66:
    print(i)
    i = i + 8
