# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

user = input("type your name: ")

uppered_user = user.upper()

print(uppered_user)

# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით

user1 = input("type your name in capital : ")

lowered_user1 = user1.lower()

print(lowered_user1)

# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი

user2 = input("type your name: ")

capital_user2 = user2.capitalize()

print(capital_user2)

# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით

my_list1 = ["rezi", "dachi", "gega", "nika", "goga"]

for name in my_list1:
    print(name.upper())

# 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით

list = ["REZI", "DACHI", "GEGA", "NIKA", "GOGA"]

for name in list:
    print(name.lower())

# 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს

my_list2 = ["rezi", "dachi", "gega", "nika", "goga"]

for name in my_list2:
    print(name.capitalize())

# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს

my_list3 = ["rezi", "dachi", "gega", 1, 1.2, True]

num = len(my_list3)

print(num)


# 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს

string = "ალექსანდრე"

string2 =len(string)

print(string2)

# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

my_list4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

count = 0

for number in my_list4:
    if number % 2 == 0:  
        count += 1
print(count)


# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა

my_list5 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

count = 0

for number in my_list5:
    if number % 2 != 0:  
        count += 1  
print(count)

# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

start = int(input("start number: "))

end = int(input("end number: "))

step = int(input("step number: "))

for i in range(start , end , step):
    if i % 2 == 0:
        print(i)
