# 1) შემოაყვანიეთ მომხმარებელს რაღაცა სიტყვა:
# -> შეამოწმეთ არის თუ არა 'a' ან 'A' ამ სიტყვაში/ტექსტში
# -> შეამოწმეთ თუ არ არის სიტყვა 'car' ამ სიტყვაში/ტექსტში

user = input("შეიყვანეთ სიტყვა ან ტექსტი: ")

if 'a' in user or 'A' in user:
    print("ტექსტში არის ასო a ან A")
else:
    print("ტექსტში არ არის ასო a ან A")

if 'car' not in user:
    print("ტექსტში არ არის სიტყვა car")
else:
    print("ტექსტში არის სიტყვა car")


# 2) მომხმარებელს შემოატანინეთ ტექსტი.
# -> დაუარეთ ამ ტექტის ასოებს for ლუპით
# -> თუ ასო არის 'a' ან 'A' დასკიპეთ, სხვა შემთხვევაში დაპრინტეთ ასო

text = input("შემოიყვანე სიტყვა ან ტექსტი: ")

for i in range(len(text)):
    if text[i] == 'a' or text[i] == 'A':
        continue
    print(text[i])













