# 1)შექმენით 10 ელემენტიანი სია, და ამ სიიდან ბოლო 5 ელემენტი გამოიტანეთ დადებითი სლაისინგით

numbers = [1,2,3,4,5,6,7,8,9,10]

siliced_numbers = numbers[5:10]

print(siliced_numbers)

# 2)შექმენით 20 ელემენტიანი სია, და ამ სიიდან პირველი 11 ელემენტი გამოიტანეთ ყაროფიტითი ინდექსებით

num = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

sliced_num = num[-20:-9]


print(sliced_num)


# 3)შექმენით 12 ელემენტიანი სია, და მომხარებელს შემოატანინე რიცხვი, შემდეგ 2 იდან მომხარებლის შემოტანილ რიცხვამდე გამოიტანე ყველა ელემენტი

num1 = [1,2,3,4,5,6,7,8,9,10,11,12]

user = int(input("აირჩიე ნებისმიერი რიცვხი 3 დან 12 ის ჩათვლით: "))

if user >= 2 and user <=13:
    print(num1[2:user])
elif user < 2 or user > 13:
    print("number not found")




