# 1) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება თქენს პირველ სიაში მყოფი მხოლოდ ლუწი რიცხვები. 
# გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.

numbers = [1,2,3,4,5,6,7,8,9,10]

new_numbers = []

for i in numbers:
    if i % 2 == 0:
        new_numbers.append(i)

print(new_numbers)


# 2) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება მხოლოდ თქენს პირველ სიაში კენტ ინდექსზე მდგომი რიცხვები 
# რომელბიც არიან აუცილებლად კენტი. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.


numbers2 = [1,2,3,4,5,6,7,8,9,10]

new_list = []

for i in numbers2:
    if i % 2 == 1:
        new_list.append(i)

print(new_list)





# 3) შექმენით სახელებით სავსე სია და ამ სიიდან ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება ასო გ-თი და მთავრდება ასო ი-თი, გამოიყენეთ for ციკლი, 
# დაწერეთ ორივე ხერხით, pop() ფუნქციითაც და remove() ფუნქციითაც.

names = ["გეგი", "გიორგი", "ნიკა", "რეზი", "დაჩი", "საბა"]

for i in range(len(names) - 1, -1, -1):
    if names[i][0] == "გ" and names[i][-1] == "ი":
        names.remove(names[i])

print(names)




names2 = ["გეგი", "გიორგი", "ნიკა", "რეზი", "დაჩი", "საბა"]

for i in range(len(names2) - 1, -1, -1):
    if names2[i][0] == "გ" and names2[i][-1] == "ი":
        names2.pop(i)

print(names2)



# 4) შექმენით სტრინგებით სავსე სია, და ამ სიიდის ყველა ის სიტყვა რომლის პირველი ასო არის Uppercase-ში და რომელიც ამავდროულად დგას კენტ ინდექსზე სიაში, 
# გაუხადეთ ასეთ სიტყვებს ყველა ასო პატარა - lowercase, ხოლო ყველა ის სიტყვა რომლის პირველი ასო არის Uppercase-ში და თან ეს სიტყვა დგას ლუწ ინდექსზე სიაში, 
# ამოშალეთ სიიდან. დაპრინტეთ შეცვლილი სია.


names3 = ["Rezi", "Gega", "Dachi", "Saba", "Alexandre"]

for i in range(len(names3) - 1, -1, -1):

    if names3[i][0].upper() and i % 2 == 1:
        names3[i].lower()

    elif names3[i][0].upper() and i % 2 == 0:
        names3.pop(i)

print(names3)


# 5) შექმენით სიტყვებით სავსე სია, ამ სიიდან ამოშალეთ ყველა სიტყვა რომელიც იწყება Uppercase დიდი ასო G-თი და რომლის ბოლო 2 ასო არის ასევე Uppercase. 
# ხოლო ყველა სიტყვა რომლის თითოეული ასო არის Lowercase-ში, აიყვანეთ Uppercase-ში შესაბამისი სტრინგის ფუნქციის გამოყენებით. დაპრინტეთ მიღებული სია.
















# 6) შექმენით 2 სია, პირველ სიაში იყოს int მონაცემთა ტიპის ელემენტები, ხოლო მეორე სია სავსე იყოს string მონაცემთა ტიპის ელემენტებით. For ციკლის საშუალებით, 
# პირველი სიიდან remove() ფუნქციით ამოშალეთ ყოველი ლუწი რიცხვი რომლებიც დგანან კენტ ინდექსზე, ხოლო მეორე სიიდან pop() ფუნქციით ამოშალეთ ყოველი ის სიტყვა 
# რომელიც იწყება დიდი ასოთი და დგას ლუწ ინდექსზე. ბოლოს შეაერთეთ ორივე შეცვლილი სიები ერთმანეთში, გახადეთ საერთო სია და დაპრინტეთ. 
# (კარგად დააკვირდით პირობას და არ იჩქაროთ. წარმატებები! ! !)





















