# 1) შექმენით სია სადაც გექნებათ მოთავსებული მხოლოდ და მხოლოდ სტრინგ ტიპის მონაცემები(სიაში შეიყვანეთ 10 სახელი),თქვენი დავალებაა ამ სიიდან გამოიტანოთ თითეული სახელი ოღნდ ცალ ცალკე,გამოიოყენეთ ინდექსინგი



box = ["rezi", "dachi", "gega", "luka", "goga", "gio", "mari", "nuca", "alexandre", "barbare"]
print(box[0])
print(box[1])
print(box[2])
print(box[3])
print(box[4])
print(box[5])
print(box[6])
print(box[7])
print(box[8])
print(box[9])



# 2) შექმენით ცვლადი სადაც შეინახავთ ბოსტნეულის სახელებს,უნდა გქონდეთ სულ 6 ბოსტნეულის სახელი,თქვენი დავალებაა რომ ამ სიაში მყოფი მე 0 ე ინდექსზე მდგომი ელემენტი ჩაანაცვლოთ "viri" ით ,ამ სიაშ მყოფი მესამე დ=ინდექსზე მდგომი ელემენტი ჩაანაცვლოთ "tagvit" და ამ სიაში მყოფი მეხუთე ინდექსზე მდგომი ელემენტი ჩაანაცვლოთ "bokveri" ით, როდესაც შეცვლი სამივე მნიშვნელობას დაპრინტე საბოლოო განახლებული სია


vegetables = ["პომიდორი", "კიტრი", "ბადრიჯანი", "ხახვი", "კარტოფილი", "სტაფილო"]


vegetables[0] = "ვირი"
vegetables[3] = "თაგვი"
vegetables[5] = "ბოკვერი"

for i in range(6):
    print(vegetables[i])




