// console.log("rezi")
// console.log(15)

/*console.log(1.80)
string ==> ყველაფერი რაც მოთავსებულია ბრჭყალებში

-------------------------------------------------------------------------------

number ==> ნებისმიერი რიცხვი მთელიც ათწილადიც და წილადიც

-------------------------------------------------------------------------------

boolean ==> true და false

-------------------------------------------------------------------------------

BigInt ==> ძალიან დიდი რიცხვები

-------------------------------------------------------------------------------

null ==> ამ მნიშვნელობის არარსებობა

-------------------------------------------------------------------------------

undefined ==> არ არსებობს(არ არის მნიშვნელობა შექმნილი)*/