# 1) მომხმარებელს შემოატანინეთ სიტყვა.  
# -> იტერაციით გაიარეთ თითო ასო  
# -> თუ შეხვდებით ასო 'e'-ს ან 'E'-ს გაჩერდით (break)  
# -> დაბეჭდეთ მხოლოდ ის ასოები, რაც მანამდე იყო


word = input("შეიყვანეთ სიტყვა: ")

for letter in word:
    if letter == 'e' or letter == 'E':
        break
    print(letter)


# 2) მომხმარებელს შემოატანინეთ წინადადება.  
# -> შეამოწმეთ არის თუ არა ტექსტში სიტყვა 'bad'  
# -> თუ არის, დაპრინტეთ "აკრძალული სიტყვა!"  
# -> თუ არაა, დაპრინტეთ "ყველაფერი რიგზეა"

user = input("შეიყვანეთ წინადადება: ")

if "bad" in user:
    print("აკრძალული სიტყვა!")
else:
    print("ყველაფერი რიგზეა")

# 3) მომხმარებელს შემოატანინეთ წინადადება.  
# -> დაუარეთ ტექსტს for ციკლით  
# -> გამოტოვეთ ყველა space => ' '
# -> დაბეჭდეთ ყველა დანარჩენი სიმბოლო 

sentence = input("შეიყვანეთ წინადადება: ")

result = ""

for space in sentence:
    if space == ' ':
        continue
    result += space

print(result)

# 4) მომხმარებელს შემოატანინეთ წინადადება.  
# -> დაუარეთ მას for ლუპით  
# -> გამოტოვეთ ხმოვნები (a, e, i, o, u)  
# -> დაბეჭდეთ მხოლოდ თანხმოვნები და თავისთავათ ყველა სხვა სიმბოლო

sentence = input("შეიყვანეთ წინადადება: ")

result = ""

for i in sentence:
    if i in ['a', 'e', 'i', 'o', 'u',]:
        continue
    result += i

print(result)


# 5) მომხმარებელს შემოაყვანით ორი რიცხვი
# --> დაუარეთ ყველა რიცვს ამ დიაპაზონში
# --> დაბეჭდეთ მხოლოდ რიგით პირველი რიცხვი ამ შუალედში რომელიც იყოფა 15-ზე
# (შეწყვიტეთ ციკლი თუ არის ეგეთი)


num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

for i in range(num1, num2):
    if i % 15 == 0:
        print(i)
        break

# 6) შექმენით უსასრულო while loop:
# --> სანამ მომხმარებელი არ შემოიყვანს 'python is best', მანამდე დაპრინტეთ 'you should learn python'

while True:
    text = input("შეიყვანეთ რაღაც: ")
    if text == "python is best":
        break
    print("you should learn python")


# 7) \<.BOSS.>/ 
# მომხმარებელს შემოაყვანით ორი რიცხვი
# --> დაუარეთ ყველა რიცვს ამ დიაპაზონში
# --> დაბეჭდეთ მხოლოდ რიგით მესამე რიცხვი ამ შუალედში რომელიც იყოფა 3-ზე
# (შეწყვიტეთ ციკლი თუ არის ეგეთი)


num3 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num4 = int(input("შეიყვანეთ მეორე რიცხვი: "))

count = 0

for i in range(num3, num4):
    if i % 3 == 0:
        count += 1
        if count == 3:
            print(i)
            break

