#1)კომენტარის სახით ახსენი თუ რომელი ოპერატორები ვისწავლეთ და რა დანიშნულება აქვთ მათ

#შედარების ოპერატორები არის :>მეტობა, <ნაკლებობა, == ტოლობა.
#მინიჭების ოპერატორები არის = . ანიჭებს მნიშვნელობას მაგ: name = "rezi" ცვლადს მივანიჭეთ მნიშვნელობა

#2)მომხმარებელს შემოაყვანინეთ ორი რიცხვი,შეადარეთ თუ პირველი რიცხვი მეტია მეორეზე,ასევე შეადარე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე,და ასევე შეადარე თუ პირველი რიცხვი უდრის მეორე რიცხვს
num1 = int(input())
num2 = int(input())
print(num1 > num2)
print(num1 < num2)
print(num1 == num2)

#3)მომხმარებელს შემოატანინეთ 5 სტრინგ ტიპის მნიშვნელობა,შენი დავალებაა მოახდინო მათი კონკატინაცია
name = str(input("whats your name?: "))
car_brand = str(input("whats your favorit car?: "))
basketball_player = str(input("who is your favorite basketball player?: "))
game = str(input("whats your favorite game?: "))
print(name + car_brand + basketball_player + game)

#4)მომხმარებელს შემოატანინე 4 რიცხვი,შენი დავალებაა გაიგო ამ რიცხვების საშუალო არითმეტიკული(დღესაც ვისაუბრეთ ამაზე,ვნახოთ როგორ გაათმევთ თავს)
num3 = int(input())
num4 = int(input())
num5 = int(input())
num6 = int(input())
print((num3 + num4 + num5 + num6)/4)

#5)შექმენი 4 ცვლადი,ამ ცვლადებშ შეინახე 4 განსხვავებული მონაცემთა ტიპის ელემენტები და დაპრინტე მათ ტიპი(გამოიყენეთ შესაბამისი ფუნქცია)
name1 = "rezi"
age = 14
height = 1.70
boolean = True and False
print(type(name1))
print(type(age))
print(type(height))
print(type(boolean))

#6)შექმენი 2 ცვლადი,შეინახე ორივე ცვლადში სტრინგ ტიპის მნიშვნელობები დაშეადარე ისინი არიან თუ არა ერთნაირები(უდრის თ არა ერთმანეთს)
str1 = "rezi magaria"
str2 = "basketball"
print(str1 == str2)

#7)შექმენი 4 ცვლადი,სადაც გექნება მოთავსებული რიცხვები ოღონდ სტრინგის სახით მაგ: "40",გადაიყვანე ეს სტრინგი რიცხვები ინტეჯერში(გამოიყენე შესაბამისი ფუნქცია) და გაიგე ამ ოთხი რიცხვის ჯამი
str3 = int("100")
str4 = int("2000")
str5 = int("54")
str6 = int("20765")
print(str3 + str4 + str5 + str6)

#8)შექმენი 3 ცვლადი,ამ ცვლადებში შეინახეთ ინტეჯერ ტიპის მონაცემები,შენი დავალებაა ეს რიცხვები გაასტრინგო(გამოიყენე შესაბამისი ფუნქცია) და გამოიტანო ეს რიცხვები ერთ წინადადებაში. მაგ:304050
int1 = str(1)
int2 = str(77)
int3 = str(9898)
print(int1 + int2 + int3)


















