# 1) შექმენით წინადადების სტრინგის ცვლადი, ამ ცვლადში დაითვალეთ ხმოვანი ასოების რაოდენობა. გამოიყენეთ for ციკლი.

sentence = "my name is rezi"

xmovani = "aeiou"

new_list = []

for i in sentence:
    if i in xmovani:
        new_list.append(i)

print(len(new_list))

# 2) შექმენით რიცხვებით სავსე სია და დაითვალეთ ამ სიაში მყოფი მხოლოდ ლუწი რიცხვების ჯამი, გამოიყენეთ for ციკლი.

numbers = [1,2,3,4,5,6,7,8,9,10]
jami = 0
for i in numbers:
    if i % 2 == 0:
        jami += i

print(jami)

# 3) შექმენით რიცხვებით სავსე სია, გაიგეთ რომელი რიცხვი არის ამ სიაში ყველაზე დიდი, გამოიყენეთ for ციკლი, 
# არ გამოიყენოთ max() ფუნქცია.

numbers2 = [1,2,3,4,5,6,7,8,9,10]

biggest = numbers2[0]

for i in numbers2:
    if i > biggest:
        biggest = i

print(biggest)

# 4) მომხმარებელს შემოატანინეთ პაროლი, თუ პაროლის სიგრძე არის 6-ზე ნაკლები, მაშინ თავიდან შემოატანინეთ ახალი პაროლი, 
# როცა პაროლის სიგრძე იქნება 6 ან 6-ზე მეტი, გააჩერეთ ციკლი და დაპრინტეთ "Your password is correct!" 
# გამოიყენეთ while ციკლი.

user = input("type password: ")

while len(user) < 6:
    user = input("type password again")

print("your password is correct")

# 5) შექმენით რიცხვებით სავსე  სია რომელშიც რამდენიმე რიცხვი მეორდება და დაპრინტეთ სია გამეორებების გარეშე, 
# აუცილებლად იგივე თანმიმდევრობით. მაგალითად: თუ მოცემული გვაქვს სია [3, 5, 3, 8, 5, 10, 8], 
# მაშინ ჩვენ უნდა დავპრინტოთ [3, 5, 8, 10]  გამოიყენეთ for ციკლი.

numbers3 = [1,1,2,3,4,3,6,8,9,4]

new_numbers = []

for i in numbers3:
    if i not in new_numbers:
        new_numbers.append(i)

print(new_numbers)

# 6) მომხმარებელს შემოატანინეთ წინადადება და ტერმინალში ყველა ახალ ხაზზე დაპრინტეთ ამ წინადადების სიტყვა
# და რიცხვი თუ რამდენჯერ მეორდება ეს სიტყვა წანადადებაში. მაგალითად: თუ მოცემული გვაქვს წინადადება
# "Hello I love apples Hello", მაშინ ტერმინალში ჯერ უნდა გამოვიდეს Hello 2, რადგან ეს სიტყვა 2-ჯერ მეორდება წინადადებაში,
# შემდეგ ხაზზე უნდა ეწეროს I 1, შემდეგ love 1, და ბოლოს apples 1. გამოიყენეთ სიები, არ გამოიყენოთ count() ფუნქცია.
