/*1)შექმენით სია სადაც მოათავსებთ 5 ელემენტს(განსხვავებული ტიპის) თქვენი
დავალებაა ინდექსების გამოყენებით გამოიტანოთ სიის თითოეული ელემენტი ცალ ცალკე*/ 

let list1 = ["rezi", 15, true, "hello",100]

console.log(list1[0])
console.log(list1[1])
console.log(list1[2])
console.log(list1[3])
console.log(list1[4])

/*2)მოცემულია მოსწავლეების ქულების სია:

let scores = [45, 78, 32, 90, 56, 67, 23, 84, 39, 71, 60, 95];

შენი დავალებაა, ინდექსების გამოყენებით განაახლო ეს სია შემდეგი წესების მიხედვით:

პირველი ელემენტი გაზარდე 15 ქულით.
მესამე ელემენტი შეცვალე რიცხვით 50.
მეხუთე ელემენტს დაუმატე 20.
მეშვიდე ელემენტი შეცვალე მისი არსებული მნიშვნელობის ორმაგი მნიშვნელობით.
მეცხრე ელემენტს გამოაკელი 10.
ბოლო ელემენტი შეცვალე 100-ით.
მეოთხე ელემენტი გახადე 75.
მეორე ელემენტი გაზარდე იმდენით, რამდენიც მე-8 ელემენტის მნიშვნელობაა.

საბოლოოდ console.log()-ში გამოიტანე განახლებული სია.*/

let scores = [45, 78, 32, 90, 56, 67, 23, 84, 39, 71, 60, 95]

scores[0] = 45 + 15
scores[2] = 50
scores[4] = 56 + 20
scores[6] = 23 * 2
scores[8] = 39 - 10
scores[11] = 100
scores[3] = 75
scores[1] = 78 + 84

console.log(scores)
