# 1)შექმენი სია 7 რიცხვით.

# დაბეჭდე პირველი და ბოლო ელემენტების ნამრავლი ისე, რომ ორივეჯერ უარყოფითი ინდექსი გამოიყენო.

# დაბეჭდე მესამე ელემენტი მარცხნიდან და მესამე ელემენტი მარჯვნიდან (უარყოფითიინდექსის გამოყენებით).

numbers = [1, 7, 4, 8, 9, 2, 5]

print(numbers[-7] * numbers[-1])

print(numbers[2])
print(numbers[-3])

# 2)შექმენი სია "apple", "banana", "cherry", "grape", "kiwi", "orange".

# დაბეჭდე შუა 2 ელემენტი (ორივე(დადებითი და უარყოფითი)) ინდექსით.


store = ["apple", "banana", "cherry", "grape", "kiwi", "orange"]


print(store[2], store[3], store[-3], store[-4])


# 3)
# შექმენი [3,4,5,6,7,1,2,9,8,11]

# მომხმარებელს შემოატანინე ერთი ინდექსი(რიცხვი) 0 დან 10 მდე.

# თუ მომხმარებლის ინდექსი დადებითია → დაბეჭდე ის ელემენტი

# თუ უარყოფით რიცხვი ან  10 ზე მეტი მაღალირიცხვი შემოიყვანა დაბეჭდეთ --> "you entered negative or more than 10  number "
numbers = [3, 4, 5, 6, 7, 1, 2, 9, 8, 11]

user_input = int(input("შეიყვანეთ ინდექსი (0-დან 10-მდე): "))

if 0 <= user_input <= 10:
    print(user_input)
else:
    print("you entered negative or more than 10 number")



# 4)შექმენით სია ["dog" ," most" ,"is" ,"angry" ,"running"  , "forest", "fast", "in" , "cat" ,"human", "very"]


# --- მინუს ინდექსების გამოყენებით შეადგინეთ შემდეგი წინადადება და დაბეჭდეთ --> "dog is running in forest very fast"

# --- აასწყვეთ ზემოთ მოცემული წინადადება ოღონდ დადებითი ინდექსებით

# --- დადებით ინდექსების გამოყენებით ააწყვეთ შემდეგი წინადადება ---> "cat is very angry"


words = ["dog", "most", "is", "angry", "running", "forest", "fast", "in", "cat", "human", "very"]

print(words[-11], words[-9], words[-7], words[-4], words[-6], words[-1], words[-5])

print(words[0],words[2],words[4],words[7],words[5],words[10],words[6])

print(words[8],words[2],words[10],words[3])


# 5)
# შექმენი სია ცხოველებით: ["dog", "cat", "horse", "cow", "sheep", "goat"].
# მომხმარებელს შემოიტანინე ინდექსი(რიცხვი)

# თუ მომხმარებლის მიერ შემოყვანილ ინდექსზე მდგომი ელემენტი არის  "cat", დაბეჭდე "შენ აირჩიე კატა".

# თუ არის "goat", დაბეჭდე "შენ აირჩიე თხა".

# სხვა შემთხვევაში დაბეჭდე "სხვა ცხოველი აირჩიე".
# ცხოველების სია
animals = ["dog", "cat", "horse", "cow", "sheep", "goat"]

index = int(input("შეიყვანე ინდექსი (0-5): "))

if 0 <= index <= 5:
    if animals[index] == "cat":
        print("შენ აირჩიე კატა")
    elif animals[index] == "goat":
        print("შენ აირჩიე თხა")
    else:
        print("სხვა ცხოველი აირჩიე")
else:
    print("შეიყვანეთ ინდექსი 0-დან 5-ის ჩათვლით")




# 6)
# შექმენი სია 6 ქალაქით.
# მომხმარებელი შემოიტანს ორ ინდექსს(რიცხვს).

# თუ პირველი ინდექსი ნაკლებია მეორეზე → დაბეჭდე ამ ინდექსებზე მდგომი ორივე ელემენტი.

# თუ მეორე ნაკლებია პირველზე → დაბეჭდე "შეცვალე ინდექსები ადგილებით"--->ზემოთ თუ დაპრინტე a და b ამ შემთხვევაში დაპრინტე b და a.

# თუ ინდექსები ერთნაირია → დაბეჭდე "ორივე ერთია" და გამოიტანე ამ ინდექსზე მდგომი ელემენტი ვთქვათ თუ შემოიყვანა მომხმარებელმა 5 და 5 დაუბეჭდე მე 5 ინდექსზე მდგომი ელემენტი.


cities = ["ქუთაისი", "თბილისი", "ბათუმი", "რუსთავი", "გორი","ფოთი"]

index1 = int(input("შემოიყვანეთ ინდექსი 0-დან 5 ის ჩათვლით"))
index2 = int(input("შემოიყვანეთ ინდექსი 0-დან 5 ის ჩათვლით"))

if index1 < index2:
    print(cities[index1],cities[index2])
elif index1 > index2:
    print("შეცვალე ინდექსები ადგილებით")
    print(cities[index2],cities[index1])
else:
    print("ორივე ერთია")
    print(cities[index1])

# 7)მომხმარებელი შემოიტანს სიტყვას.

# თუ პირველი ასო "a"-ა → დაბეჭდე "სიტყვა იწყება a-თი".

# თუ ბოლო ასო "z"-ია → დაბეჭდე "სიტყვა მთავრდება z-ით".

# სხვაგვარად → დაბეჭდე "სიტყვა არც a-თი იწყება და არც z-ით მთავრდება".


user = input("შეიყვანეთ სიტყვა: ")

if user[0] == "a":
    print("სიტყვა იწყება a-თი")
elif user[-1] == "z":
    print("სიტყვა მთავრდება z-ით")
else:
    print("სიტყვა არც a-თი იწყება და არც z-ით მთავრდება")



# 8)დავალება 4

# მომხმარებელი შემოიტანს სიტყვას.

# თუ პირველი და ბოლო ასო ერთმანეთს ემთხვევა → დაბეჭდე "პირველი და ბოლო ერთნაირია".

# თუ განსხვავდება → "პირველი და ბოლო განსხვავებულია".




user2 = input("შეიყვანეთ სიტყვა: ")

if user2[0] == user2[-1]:
    print("პირველი და ბოლო ერთნაირია")
else:
    print("პირველი და ბოლო განსხვავებულია")



# 9)შექმენი ცვლადი სადაც შეინახავთ შემდეგ ასოებს ---> "agivorsbgitr"
 

# ----ამ სიიდან შეადგინე სიტყვა "goga, 

# ----ამ სიტყვიდან შეადგინე სიტყვა "saba"

# ----ამ სიტყვიდან შეადგინე სიტყვა "bativar"


word ="agivorsbgitr"
# gogas daprintva
print(word[1], word[4], word[-4], word[0])
# sabas daprintva
print(word[6], word[0], word[-5], word[0])
# bativaris daprintva
print(word[-5], word[0], word[-2], word[2], word[3], word[0], word[-1],)



# 10)შექმენი შემდეგი სტრინგი --> 'giorgi'

# შენი დავალებააა რომ for დდა while loop ის დახმარებით გამოიტანო ამ სტრინგის თითეული ასო ცალ ცალკე

name = "giorgi"

for i in range(6):
    print(name[i])

i = 0
while i < 6:
    print(name[i])
    i += 1




