# 1) შექმენით სია რომელშიც იქნება მხოლოდ int მონაცემთა ტიპის ელემენტები, ამ სიიდან ამოშალე ყოველი რიცხვი რომელიც არის ლუწი ან დგას კენტ ინდექსზე სიაში, 
# გამოიყენეთ remove() ფუნქცია და for ციკლი.

num = [1,2,3,4,5,6,7,8,9,10]

for i in range(len(num)-1, -1, -1):
    if num[i] % 2 == 0 or i % 2 == 1:
        num.remove(num[i])

print(num)



# 2) შექმენით სია რომელშიც იქნება მხოლოდ სტრინგ მონაცემთა ტიპის ელემენტები, ამ სიის ბოლოში ცალ-ცალკე მეორედ ჩაამატე ყველა ის სიტყვა რაც უკვე არის ამ სიაში, 
# გამოიყენეთ for ციკლი და სიის შესაბამისი ფუნქცია.

string = ["Rezi", "Gega", "Dachi", "Saba", "Alexandre"]

height = len(string)

for i in range(height):
    string.append(string[i])

print(string)


# 3) შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით, რიცხვებით სავსე სიიდან, 
# სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. გამოიყენეთ for ციკლი და შესაფერისი სიის ფუნქცია.

strings = ["Rezi", "Gega", "Dachi", "Saba", "Alexandre"]

numbers = [1,2,3,4,5,6,7,8,9,10]

for num in numbers:
    if 20 < num and num < 50:
        strings.append(num)

print(strings)

# 4) შექმენით სიტყვებით სავსე სია და ამ სიაში ყველა ისეთ სიტყვას რომელიც იწყება პატარა ასოთი, პირველი ასო გაუხადეთ დიდი. გამოიყენეთ for ციკლი და სტრინგის შესაბამისი ფუნქცია.

word = ["Rezi", "Gega", "Dachi", "Saba", "Alexandre"]

for i in range(len(word)):
    if word[i][0].lower():
        word[i] = word[i].capitalize()

print(word)

# 5) თქვენი სიტყვებით ახსენით რას აკეთებს გავლილი მასალიდან ყველა შესწავლილი სიის და სტრინგის ფუნქციები და for ციკლი.

# append() სიის ბოლოში ერთ ელემენტს სვამს

# remove() წაშლის სიისგან იმ ელემენტს რომელსაც მივუთითებთ

# pop() ამოიღებს ელემენტს სიისგან ინდექსის მიხედვით  თუ ინდექსი არ არის, ამოიღებს ბოლო ელემენტს

# insert() ჩასვამს ელემენტს სიის კონკრეტულ ინდექსზე

# extend()	ერთი სიას ამატებს მეორეს

# index()	აბრუნებს რომელ ელემენტსაც მივუთითებთ მაგის ინდექსს 

# count()	ითვლის რამდენჯერ არის ელემენტი  სიაში

# reverse()	ატრიალებს სიას უკუღმა

# clear()	სიას მთლიანად შლის

# capitalize() პირველ ასოს ადიდებს 

# lower()  სიტყვას აპატარავებს 

# upper()  სიტყვას ადიდებს

# for ციკლით შეგვიძლია გავიმეოროთ ერთი და იგივე მოქმედება რამდენჯერაც გვინდა იმდენჯერ, და ასევე შეგვიძლია გადავუაროთ სიას


