# 1) შექმენით სიტყვებით სავსე სია, თუ სიტყვის ყველა ასო არის პატარა, ანუ წერია lowercase-ში, ამ სიტყვის ყველა ასო გახადეთ დიდი.
# თუ სიტყვა შეიცავს თუნდაც ერთ uppercase ასოს, ეს სიტყვა ამოშალეთ სიიდან. ბოლოს დაპრინტეთ მიღებული სია. 
# (არ შექმნათ ახალი სია, იმუშავეთ პირველ სიტყვების სიაში) გამოიყენეთ while ციკლი.


words = ["hello", "rezi", "Car", "basketball"]

i = 0

while i < len(words):
    if words[i] != words[i].lower():
        words.pop(i)
        i += 1
    else:
        words[i] = words[i].upper()

print(words)

# 2) შექმენით სტრინგის ცვლადი და ცარიელი სია. სტრინგში მყოფი დიდი ასოები გახადეთ პატარა და ამ სიაში ჩაამატეთ, 
# ხოლო სტრინგში მყოფი პატარა ასოები გახადეთ დიდი და ასევე ჩააგდეთ ამ სიაში. დაპრინტეთ საბოლოო სია, გამოიყენეთ while ციკლი.

text = "HeLLoWorLd"
list1 = []

i = 0
while i < len(text):
    if text[i] == text[i].upper():
        list1.append(text[i].lower())
    else:
        list1.append(text[i].upper())
    i += 1

print(list1)

# 3) შექმენით სახელებით სავსე სია, ასევე შექმენით ცარიელი სია, თუ სიტყვის ყველა ასო არის პატარა, 
# მაშინ ამ სიტყვის ყველა ასო გახადეთ დიდი და შესაბამისი სიის ფუნქციის გამოყენებით ჩასვით ეს სიტყვა ცარიელი სიის დასაწყისში, 
# ხოლო თუ სიტყვის ყველა ასო არის დიდი, მაშინ ამ სიტყვის ყველა ასო გახადეთ პატარა და შესაბამისი სიის ფუნქციის გამოყენებით 
# ჩასვით ეს სიტყვა ცარიელი სიის ბოლოში. ბოლოს დაპრინტეთ მიღებული სია. გამოიყენეთ for ციკლი.

names = ["rezi", "GEGA", "nika", "DACHI", "saba"]

list2 = []

for i in names:
    if i == i.lower():
        list2.insert(0, i.upper())
    elif i == i.upper():
        list2.append(i.lower())

print(list2)

# 4) შექმენით ქალაქების სია, წაშალეთ pop() ან remove() ფუნქციით ყველა ის სიტყვა რომლის ყველა ასო არის დიდი, 
# ხოლო ყველა სხვა სიტყვას ყველა ასო გაუხადეთ დიდი. დაპრინტეთ საბოლოო შედეგი. გამოიყენეთ while ციკლი.

cities = ["Tbilisi", "BATUMI", "kutaisi", "rustavi"]

i = 0

while i < len(cities):
    if cities[i] == cities[i].upper():
        cities.pop(i)
    else:
        cities[i] = cities[i].upper()
        i += 1

print(cities)

# 5) შექმენით გვარებით სავსე სია, თუ სიტყვის ყველა ასო არის პატარა, მაშინ ეს სიტყვა ამოშალეთ ამ სიიდან და თავიდან ჩაამატეთ იგივე სიაში, 
# ოღონდ ერთი ინდექსით მარჯვნივ, და ყველა ასო ჰქონდეს დიდი. ხოლო თუ სიტყვის ყველა ასო არის დიდი, მაშინ ეს სიტყვა ამოშალეთ ამ სიიდან
# და თავიდან ჩაამატეთ იგივე სიაში, ოღონდ ერთი ინდექსით მარცხნივ, და ყველა ასო ჰქონდეს პატარა. იმუშავეთ ერთ სიაში, გამოიყენეთ while ციკლი.

surnames = ["rezesidze", "ARKANIA", "gabunia", "SAGLIANI"]

i = 0
while i < len(surnames):
    arr = surnames[i]
    if arr == arr.lower():
        surnames.pop(i)
        surnames.insert(i + 1, arr.upper())
        i += 1
    else:
        surnames.pop(i)
        surnames.insert(i - 1, arr.lower())
        i += 1

print(surnames)

# 6) შექმენით სტრინგის ცვლადი და ცარიელი სია, თუ სტრინგის ასო არის პატარა, მაშინ ცარიელ სიაში ჩაამატეთ "+" ნიშანი, ხოლო თუ სტრინგის ასო არის დიდი, 
# მაშინ ცარიელ სიაში ჩაამატეთ "-" ნიშანი. თუ მინუსების რაოდენობა სიაში არის ლუწი, მაშინ წაშალე ყველა "+" ნიშანი, 
# ხოლო თუ მინუსების რაოდენობა სიაში არის კენტი, წაშალე ყველა "-" ნიშანი. "+" და "-" -ების თავიდან სიაში ჩასაგდებად გამოიყენეთ for ციკლი, 
# ხოლო "+" ან "-" -ების წასაშლელად გამოიყენეთ while ციკლი.

text = "HELLOworld"

idk = []

for i in text:
    if i == i.lower():
        idk.append("+")
    elif i == i.upper():
        idk.append("-")


minus = idk.count("-")
i = 0

while i < len(idk):
    if minus % 2 == 0:
        if idk[i] == "+":
            idk.pop(i)
        else:
            i += 1
    else:
        if idk[i] == "-":
            idk.pop(i)
        else:
            i += 1

print(idk)

# 7) შექმენით წინადადების სტრინგის ცვლადი და ცარიელი სია, ცარიელ სიაში ჩაამატეთ სიტყვები ცალ-ცალკე, არა ასოები, 
# არამედ მთლიანი სიტყვები. ამაზე იჭყლიტეთ ტვინი, წარმატებებს გისურვებთ.

sentence = "hello world my name is rezi"
words = []

current_word = ""

for i in sentence:
    if i != " ":
        current_word += i
    else:
        words.append(current_word)
        current_word = ""

if current_word != "":
    words.append(current_word)

print(words)

# 8) შექმენით სტრინგის ცვლადი და შემოაბრუნეთ ეს სტრინგი. არ გამოიყენოთ slicing. და ყველა ასო გაუხადეთ დიდი. დაპრინტეთ საბოლოო სტრინგი.















