/*1)შექმენი სია სადაც მოათავსებ ადამიანის სახელებს,
შენი დავალებაა რომ ამ სიას გადაუარო ფორ ლუპით
და გამოიტანო მხოლოდ ის ელემენტები რომლის სიგრძე
მეტია 5 ზე და იწყება ასო "g" ზე*/

let names = ["rezi","goga","gega","genadi","dachi"]

for(let i = 0; i < names.length; i++){
    if(names[i].length > 5 && names[i].startsWith("g")){
        console.log(names[i])
    }
}

/*2)შექმენი სია სადაცც იქნება მხოლოდ რიცხვები , შენი დავალებაა გამოიტანო მხოლოდ ისეთი რიცხვები რომელიც ლუწია ან 100 ზე მეტია*/

let nums = [1,2,3,4,5,6,7,8,9,10]

for(let i = 0; i < nums.length; i++){
    if(nums[i] % 2 == 0 || nums[i] > 100){
        console.log(nums[i])
    }
}

/*3)შექმენი სია სადაც იქნება სტრინგ ტიპის მოანცემები , შენი დავალებაა გამოიტანო ეს სტრინგები შემდეგნაირად -->
1 გოგა
2 საბა
3 იოანე 
...და ა.შ*/ 

let strings = ["rezi","hello","world","GOA"]

for(let i = 0; i < strings.length; i++){
    console.log((i + 1) + " " + strings[i])
}







