# // ასეთი გაყოფა გვიბრუნებს ყოველთვის ინტეჯერ ტიპის მონაცემს(მთელ რიცხვს)და პასუხად გვაძლევს: თუ რამდენჯერ მოთავსდება ერთი რიცხვი მეორე რიცხვში მაგ: 
print(100//20)
print(12//6)
print(79//70)

# ** --> ეს ოპერატორი გვეხმარება რომ რიცხვი ავიყვანოთ რაიმე ხარისხში, მაგ: 
print(10**4)
print(168784**2)
print(14**12)


#   %  --> გვიბრუნებს ნაშთს როდესაც ერთ რიცხვს ვყობთ მეორეზე მაგ:
print(100%14)
print(54%23)
print(42%6)


# სიები გვეხმარება რომ შევინახოთ მრავალი ელემენტი ნებისმიერი მონაცემთა ტიპის და ნებოისმიერი რაოდენობის სიის შესაქმნელად ვიყენებთ კვადრატულ ფრჩხილებს და სიას ვარქმევთ სახელს ხოლო ცვლადებშოი მხოლოდ 1 ელემენტის გამყენება შეგვიძლია ნებისმიერი მონაცემთა ტიპით



rezi_rezesidze = ["rezi",14,1.7,True]


print(rezi_rezesidze)















