#data type--მონაცემთა ტიპები

#string--ტექსტი რომელიც მოცემული გვაქვს ბრჭყალებში მაგ:"რეზი" , "საქართველო" , "24"

#integer--ინტეგერი არის მთელი რიცხვები მაგ: 10, 20, 30, 40, 50, 590

#float--ათწილადი რიცხვები მაგ: 14.50, 2.5, 20.75

#boolean(ბულიონ)--ბულეანს გადაეცემა მხოლოდ ორი მნიშვნელონა ესენია : True და False

#print--არის ფუნქცია რომელსაც გამოაქვს შედეგი ტერმინალში 


print("rezi rezesidze")
print(240)
print(24.25)
 
#ცვლადი არის ყუთი რომელშიც ვინახავთ ელემენტებს და სხვადასხვა მოქმედებების შედეგს. ცვლადი ანუ variables
name="rezi"
age=14
height=1.70
gear="compiuter"
country="saqartvelo"
car="porche"